app/controllers/api/albums_controller.rb

SELECT "albums".* FROM "albums"
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" IN ($1, $2, $3, $4)  [["album_id", 8], ["album_id", 9], ["album_id", 10], ["album_id", 11]]
---
    def index
        @albums = Album.all.includes(:tracks)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def show
        # debugger
        @album = Album.find(params[:id])